/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "กำลังนำ NUIStyleSheet ไปใช้";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "กำลังนำ SAP Mobile Services LogSettings ไปใช้";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "การรับรองความถูกต้องล้มเหลว!";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "กำลังตรวจสอบความถูกต้องของข้อมูลประจำตัว";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการยกเลิกกระบวนการจัดเตรียมระบบ?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการยกเลิกกระบวนการคืนค่า?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการยกเลิกกระบวนการรีเซ็ตรหัสผ่านอุปกรณ์?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการยกเลิกกระบวนการรับรองความถูกต้อง?";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการรีเซ็ตรหัสผ่านอุปกรณ์?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการยกเลิกกระบวนการเปลี่ยนแปลงรหัสผ่านอุปกรณ์?";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "คุณแน่ใจหรือไม่ว่าต้องการรีเซ็ตแอพพลิเคชันของคุณ?";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "ขั้นตอนโดยรวม";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "กำลังดาวน์โหลด SAP Mobile Services ClientResources";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "กำลังดาวน์โหลดปลายทางของ SAP Mobile Services";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "กำลังดาวน์โหลดการกำหนดค่าของ SAP Mobile Services";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "ดำเนินการต่อ";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "ดำเนินการต่อ";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "เปิดใช้งาน";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "เปิดใช้งาน";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "กรุณาใช้รหัสผ่านอุปกรณ์เพื่อเข้าสู่ระบบในครั้งถัดไป";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "Face ID จะไม่สามารถใช้ได้อีกต่อไป";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "การเปลี่ยนแปลงนโยบาย";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "กรุณาใช้รหัสผ่านอุปกรณ์เพื่อเข้าสู่ระบบในครั้งถัดไป";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "Touch ID จะไม่สามารถใช้ได้อีกต่อไป";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "การเปลี่ยนแปลงนโยบาย";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "คุณสามารถเปิดหรือปิดฟีเจอร์นี้ได้ทุกเมื่อในการกำหนดค่า";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Face ID พร้อมใช้งานแล้ว! การเปิดใช้งาน Face ID จะทำให้คุณเข้าถึงข้อมูลของคุณได้รวดเร็วยิ่งขึ้น";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "Face ID";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "คุณสามารถเปิดหรือปิดฟีเจอร์นี้ได้ทุกเมื่อในการกำหนดค่า";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Touch ID พร้อมใช้งานแล้ว! การเปิดใช้งาน Touch ID จะทำให้คุณเข้าถึงข้อมูลของคุณได้รวดเร็วยิ่งขึ้น";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "Touch ID";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "ดำเนินการต่อ";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "กรุณาสร้างรหัสผ่านอุปกรณ์ใหม่";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "นโยบายรหัสผ่านอุปกรณ์มีการเปลี่ยนแปลง";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "การเปลี่ยนแปลงนโยบาย";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "ตั้งแต่นี้เป็นต้นไป คุณไม่จำเป็นต้องใช้รหัสผ่านอุปกรณ์และ Face ID ในการเข้าสู่ระบบอีกต่อไป \n\n คุณจะเข้าสู่แอพได้ทันที";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "ตั้งแต่นี้เป็นต้นไป คุณไม่จำเป็นต้องใช้รหัสผ่านอุปกรณ์และ Touch ID ในการเข้าสู่ระบบอีกต่อไป \n\n คุณจะเข้าสู่แอพได้ทันที";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "ตกลง";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "ตั้งแต่นี้เป็นต้นไป คุณไม่จำเป็นต้องใช้รหัสผ่านอุปกรณ์ในการเข้าสู่ระบบอีกต่อไป \n\n คุณจะเข้าสู่แอพได้ทันที";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "นโยบายการเข้าสู่ระบบมีการเปลี่ยนแปลง";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "การแจ้ง";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "ดำเนินการต่อ";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "ตั้งแต่เวอร์ชันนี้ รหัสผ่านอุปกรณ์เป็นรายการบังคับ กรุณาสร้างรหัสผ่านอุปกรณ์สำหรับแอพพลิเคชัน";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "รหัสผ่านอุปกรณ์เป็นรายการบังคับ";

/* XBUT: Text of No button. */
"noButtonText" = "ไม่ใช่";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "กำลังตรวจสอบความถูกต้องของข้อมูลประจำตัว OAuth 2.0";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "เมื่อต้องการเปิดใช้งาน Face ID ให้ป้อนรหัสผ่านอุปกรณ์:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "เมื่อต้องการเปิดใช้งาน Touch ID ให้ป้อนรหัสผ่านอุปกรณ์:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "หากไม่มีความยินยอม คุณจะไม่สามารถดำเนินการจัดเตรียมระบบต่อได้";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "ให้ความยินยอม";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "ออกจากกระบวนการ";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "กำลังตรวจสอบความถูกต้องของข้อมูลประจำตัว SAML";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "กำลังตรวจสอบความถูกต้องของข้อมูลประจำตัว SAP Mobile Services UserIdentity Discovery";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "กำลังตรวจสอบความถูกต้องของข้อมูลประจำตัว SLS";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "กรุณาเติมข้อมูลในฟิลด์ทั้งหมด";

/* XBUT: Text of Yes button. */
"yesButtonText" = "ใช่";

/* XBUT: Text of Continue button. */
"continueButtonText" = "ดำเนินการต่อ";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "ยกเลิก";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "การรวบรวมการใช้";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "ผู้ดูแลแอพพลิเคชันขอให้คุณอนุญาตให้รวบรวมข้อมูลเกี่ยวกับการใช้แอพพลิเคชันของคุณเพื่อรับข้อมูลเชิงลึกสำหรับการปรับปรุงแอพ การรวบรวมข้อมูลมีข้อมูลเกี่ยวกับวิธีการใช้แอพของคุณ เช่น เวลาที่ใช้แอพหรือวิธีการที่คุณเนวิเกตในแอพ";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "คุณต้องการปฏิเสธเข้าร่วมหรือไม่?";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "คุณต้องการยินยอมเข้าร่วมหรือไม่?";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "การรวบรวมรายงานความล้มเหลว";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "ผู้ดูแลแอพพลิเคชันขอให้คุณอนุญาตให้รวบรวมข้อมูลเพื่อวินิจฉัยและวิเคราะห์ความล้มเหลวของแอพสำหรับการปรับปรุงความเสถียรของแอพ โดยข้อมูลที่รวบรวมจะถูกจำกัดไว้ที่รายงานความล้มเหลวและข้อมูลอุปกรณ์";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "ล้มเหลว!";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "การตรวจสอบลายเซ็นรหัส QR ล้มเหลว!";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "ลายเซ็นดิจิตอลรหัส QR ได้รับการตรวจสอบแล้ว คุณจะเชื่อมต่อกับ:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "ข้อผิดพลาดในการรับรองความถูกต้อง";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "เราไม่สามารถรับรองความถูกต้องของคุณได้ กรุณาลงชื่อเข้าใช้";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "ข้อผิดพลาด";

